mainly doc update.
